<a href="https://colab.research.google.com/github/daje0601/DS_project/blob/main/%EB%B9%85%EB%B6%84%EA%B8%B0%EC%8B%A4%EA%B8%B0_%EC%A4%80%EB%B9%84_%EC%BD%94%EB%93%9C.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import warnings
warnings.filterwarnings("ignore")

import pandas as pd

y_train = pd.read_csv('https://raw.githubusercontent.com/Datamanim/dataq/main/y_train.csv')
X_train = pd.read_csv('https://raw.githubusercontent.com/Datamanim/dataq/main/X_train.csv',encoding='euc-kr')
test  = pd.read_csv('https://raw.githubusercontent.com/Datamanim/dataq/main/X_test.csv',encoding='euc-kr')

In [ ]:
train = pd.concat([X_train, y_train], axis=1)
train = train.drop(columns="cust_id")
test = test.drop(columns="cust_id")
train, test

(           총구매액     최대구매액       환불금액   주구매상품  ...   내점당구매건수    주말방문비율  구매주기  gender
 0      68282840  11264000  6860000.0      기타  ...  3.894737  0.527027    17       0
 1       2136000   2136000   300000.0     스포츠  ...  1.500000  0.000000     1       0
 2       3197000   1639000        NaN  남성 캐주얼  ...  2.000000  0.000000     1       1
 3      16077620   4935000        NaN      기타  ...  2.444444  0.318182    16       1
 4      29050000  24000000        NaN      보석  ...  1.500000  0.000000    85       0
 ...         ...       ...        ...     ...  ...       ...       ...   ...     ...
 3495    3175200   3042900        NaN      골프  ...  2.000000  1.000000     0       1
 3496   29628600   7200000  6049600.0    시티웨어  ...  1.625000  0.461538    40       1
 3497      75000     75000        NaN    주방용품  ...  1.000000  0.000000     0       0
 3498    1875000   1000000        NaN     화장품  ...  1.000000  0.000000    39       0
 3499  263101550  34632000  5973000.0      기타  ...  2.421053  0.467391     8       0

 [3500 rows x 10 columns],
            총구매액     최대구매액        환불금액   주구매상품  ... 내점일수    내점당구매건수    주말방문비율  구매주기
 0      70900400  22000000   4050000.0      골프  ...   13   1.461538  0.789474    26
 1     310533100  38558000  48034700.0     농산물  ...   90   2.433333  0.369863     3
 2     305264140  14825000  30521000.0    가공식품  ...  101  14.623762  0.083277     3
 3       7594080   5225000         NaN    주방용품  ...    5   2.000000  0.000000    47
 4       1795790   1411200         NaN     수산품  ...    3   2.666667  0.125000     8
 ...         ...       ...         ...     ...  ...  ...        ...       ...   ...
 2477   82581500  23976000         NaN      골프  ...    8   1.750000  0.642857    40
 2478     480000    480000         NaN    섬유잡화  ...    1   1.000000  0.000000     0
 2479  260003790  25750000         NaN  남성 캐주얼  ...   19   3.736842  0.915493    18
 2480   88991520  18120000         NaN      육류  ...    5   3.600000  0.444444    60
 2481     623700    209000         NaN    가공식품  ...    2   5.000000  0.000000    31

 [2482 rows x 9 columns])

In [ ]:
train.describe()

               총구매액         최대구매액  ...         구매주기       gender
count  3.500000e+03  3.500000e+03  ...  3500.000000  3500.000000
mean   9.191925e+07  1.966424e+07  ...    20.958286     0.376000
std    1.635065e+08  3.199235e+07  ...    24.748682     0.484449
min   -5.242152e+07 -2.992000e+06  ...     0.000000     0.000000
25%    4.747050e+06  2.875000e+06  ...     4.000000     0.000000
50%    2.822270e+07  9.837000e+06  ...    13.000000     0.000000
75%    1.065079e+08  2.296250e+07  ...    28.000000     1.000000
max    2.323180e+09  7.066290e+08  ...   166.000000     1.000000

[8 rows x 8 columns]

In [ ]:
test.describe()

               총구매액         최대구매액  ...       주말방문비율         구매주기
count  2.482000e+03  2.482000e+03  ...  2482.000000  2482.000000
mean   1.010275e+08  2.177048e+07  ...     0.293812    20.286060
std    1.732132e+08  3.504919e+07  ...     0.282600    24.108756
min   -3.744000e+07 -3.744000e+07  ...     0.000000     0.000000
25%    5.076868e+06  2.884350e+06  ...     0.023456     4.000000
50%    3.051686e+07  1.075250e+07  ...     0.250000    13.000000
75%    1.264255e+08  2.627700e+07  ...     0.423566    27.000000
max    2.861238e+09  5.932250e+08  ...     1.000000   177.000000

[8 rows x 7 columns]

In [ ]:
train[train["총구매액"] < 0] # 1659, 3174, 3488

          총구매액     최대구매액         환불금액 주구매상품  ...   내점당구매건수    주말방문비율  구매주기  gender
1659  -2992000  -2992000    2992000.0  디자이너  ...  1.000000  0.000000     0       0
3174 -52421520  13616000   97222000.0    기타  ...  4.444444  0.337500    16       0
3488 -18905600  82306000  529602320.0  디자이너  ...  1.064516  0.242424    11       0

[3 rows x 10 columns]

In [ ]:
# 0보다 작은 금액 제거 
train = train[train["총구매액"]>0]
test = test[test["총구매액"]>0]

In [ ]:
train.isnull().sum()

총구매액          0
최대구매액         0
환불금액       2295
주구매상품         0
주구매지점         0
내점일수          0
내점당구매건수       0
주말방문비율        0
구매주기          0
gender        0
dtype: int64

In [ ]:
test.isnull().sum()

총구매액          0
최대구매액         0
환불금액       1611
주구매상품         0
주구매지점         0
내점일수          0
내점당구매건수       0
주말방문비율        0
구매주기          0
dtype: int64

In [ ]:
train["환불금액"] = train["환불금액"].fillna(0)
test["환불금액"] = test["환불금액"].fillna(0)

In [ ]:
print("train null :", train.isnull().sum().sum(), ",", "test null :",test.isnull().sum().sum())

train null : 0 , test null : 0

In [ ]:
train.dtypes

총구매액         int64
최대구매액        int64
환불금액       float64
주구매상품       object
주구매지점       object
내점일수         int64
내점당구매건수    float64
주말방문비율     float64
구매주기         int64
gender       int64
dtype: object

In [ ]:
train["주구매지점"].value_counts()

본  점     1074
잠실점       474
분당점       433
부산본점      243
영등포점      240
일산점       197
강남점       145
광주점       114
노원점        90
청량리점       86
대전점        70
미아점        69
부평점        57
동래점        49
관악점        46
인천점        34
안양점        29
포항점        11
대구점         7
울산점         6
센텀시티점       6
전주점         5
창원점         4
상인점         1
Name: 주구매지점, dtype: int64

In [ ]:
train["주구매상품"].value_counts()

기타        594
가공식품      546
농산물       339
화장품       264
시티웨어      211
디자이너      190
수산품       153
캐주얼       101
명품        100
섬유잡화       98
골프         82
스포츠        68
일용잡화       64
모피/피혁      57
육류         57
남성 캐주얼     55
구두         54
건강식품       47
차/커피       43
아동         40
피혁잡화       39
축산가공       35
주방용품       32
셔츠         30
젓갈/반찬      29
주방가전       26
트래디셔널      23
남성정장       22
주류         14
생활잡화       14
가구         10
커리어         9
란제리/내의      8
대형가전        8
식기          7
액세서리        5
침구/수예       4
통신/컴퓨터      3
보석          3
악기          2
소형가전        2
남성 트랜디      2
Name: 주구매상품, dtype: int64

In [ ]:
train

           총구매액     최대구매액       환불금액   주구매상품  ...   내점당구매건수    주말방문비율  구매주기  gender
0      68282840  11264000  6860000.0      기타  ...  3.894737  0.527027    17       0
1       2136000   2136000   300000.0     스포츠  ...  1.500000  0.000000     1       0
2       3197000   1639000        0.0  남성 캐주얼  ...  2.000000  0.000000     1       1
3      16077620   4935000        0.0      기타  ...  2.444444  0.318182    16       1
4      29050000  24000000        0.0      보석  ...  1.500000  0.000000    85       0
...         ...       ...        ...     ...  ...       ...       ...   ...     ...
3495    3175200   3042900        0.0      골프  ...  2.000000  1.000000     0       1
3496   29628600   7200000  6049600.0    시티웨어  ...  1.625000  0.461538    40       1
3497      75000     75000        0.0    주방용품  ...  1.000000  0.000000     0       0
3498    1875000   1000000        0.0     화장품  ...  1.000000  0.000000    39       0
3499  263101550  34632000  5973000.0      기타  ...  2.421053  0.467391     8       0

[3490 rows x 10 columns]

In [ ]:
train[train["gender"]==1].describe().round(2)

               총구매액         최대구매액          환불금액  ...   주말방문비율     구매주기  gender
count  1.316000e+03  1.316000e+03  1.316000e+03  ...  1316.00  1316.00  1316.0
mean   6.029865e+07  1.495320e+07  3.856970e+06  ...     0.33    22.28     1.0
std    1.210862e+08  2.761925e+07  1.681849e+07  ...     0.33    26.65     0.0
min    5.000000e+03  5.000000e+03  0.000000e+00  ...     0.00     0.00     1.0
25%    2.352638e+06  1.614278e+06  0.000000e+00  ...     0.00     0.00     1.0
50%    1.288002e+07  6.164500e+06  0.000000e+00  ...     0.27    14.00     1.0
75%    6.090238e+07  1.700000e+07  0.000000e+00  ...     0.50    32.25     1.0
max    9.981312e+08  3.910000e+08  2.107714e+08  ...     1.00   162.00     1.0

[8 rows x 8 columns]

In [ ]:
train[train["gender"]==0].describe().round(2)

               총구매액         최대구매액          환불금액  ...   주말방문비율     구매주기  gender
count  2.174000e+03  2.174000e+03  2.174000e+03  ...  2174.00  2174.00  2174.0
mean   1.115173e+08  2.255219e+07  1.070829e+07  ...     0.29    20.23     0.0
std    1.820413e+08  3.408443e+07  3.378378e+07  ...     0.26    23.53     0.0
min    1.000000e+04  1.000000e+04  0.000000e+00  ...     0.00     0.00     0.0
25%    8.404250e+06  4.320000e+06  0.000000e+00  ...     0.07     5.00     0.0
50%    4.189057e+07  1.178600e+07  0.000000e+00  ...     0.25    13.00     0.0
75%    1.430845e+08  2.687500e+07  5.557500e+06  ...     0.41    27.00     0.0
max    2.323180e+09  7.066290e+08  5.637530e+08  ...     1.00   166.00     0.0

[8 rows x 8 columns]

In [ ]:

train["환불금액비율"] = train["환불금액"]/train["총구매액"]
train["총구매건수"] = train["내점일수"]*train["내점당구매건수"]
train["구매건당지출금액"] = train["총구매액"]/train["총구매건수"]



test["환불금액비율"] = test["환불금액"]/test["총구매액"]
test["총구매건수"] = test["내점일수"]*test["내점당구매건수"]
test["구매건당지출금액"] = test["총구매액"]/test["총구매건수"]

In [ ]:
train.columns

Index(['총구매액', '최대구매액', '환불금액', '주구매상품', '주구매지점', '내점일수', '내점당구매건수', '주말방문비율',
       '구매주기', 'gender', '환불금액비율', '총구매건수', '구매건당지출금액'],
      dtype='object')

In [ ]:
len(train)

3490

In [ ]:
cols = ['총구매액', '최대구매액', '환불금액', '내점일수', '내점당구매건수', '주말방문비율', '구매주기', '환불금액비율', '총구매건수', '구매건당지출금액'] 

Q1 = train[cols].quantile(0.005)
Q3 = train[cols].quantile(0.995)

train = train[~((train[cols]< Q1) | (train[cols] > Q3)).any(axis=1)]

In [ ]:
len(train)

3330

In [ ]:
from sklearn.preprocessing import StandardScaler, OrdinalEncoder
from sklearn.model_selection import train_test_split

In [ ]:
encoder = OrdinalEncoder()
encoder.fit(train[["주구매상품", "주구매지점"]])

train[["주구매상품", "주구매지점"]] = encoder.transform(train[["주구매상품", "주구매지점"]] )
test[["주구매상품", "주구매지점"]] = encoder.transform(test[["주구매상품", "주구매지점"]])

In [ ]:
val = train.iloc[:300, :]
train = train.iloc[300:, :]

In [ ]:
train.shape

(2444, 13)

In [ ]:
len(train), len(val)

(2444, 300)

In [ ]:
train['gender'].value_counts()
from sklearn.utils import resample

#separate majoirty and minority classes
train_minority = train[train['gender'] == 1]
train_majority = train[train['gender'] == 0]

#Upsample minority class
train_minority_upsampled = resample(train_minority, 
                                replace = True,
                                n_samples = len(train_majority),
                                random_state= 123)

In [ ]:
#combine
train_altered = pd.concat([train_majority, train_minority_upsampled])
train_altered['gender'].value_counts()

#5. Scaling
#데이터셋 분리
y_train = train_altered[['gender']]

In [ ]:
X_train = train_altered.drop(columns = y_train.columns)

In [ ]:
y_val = val[["gender"]]
X_val = val.drop(columns = y_val.columns)

In [ ]:

import xgboost as xgb
from sklearn.pipeline import Pipeline, make_pipeline
from sklearn.model_selection import train_test_split,GridSearchCV, cross_val_score
from sklearn.preprocessing import StandardScaler

In [ ]:
pipe = Pipeline([("scaler", StandardScaler()), ("model", xgb.XGBClassifier())])

train_scores = cross_val_score(pipe, X_train, y_train, cv=5, scoring="roc_auc")
val_scores = cross_val_score(pipe, X_val, y_val, cv=10, scoring="roc_auc")

print(train_scores.mean())
print(val_scores.mean())

0.7318959930475101
0.5891124401913875

In [ ]:
from sklearn.pipeline import Pipeline, make_pipeline
from sklearn.svm import SVC
from sklearn.ensemble import RandomForestClassifier

pipe = Pipeline([('model', xgb.XGBClassifier())])

param_grid = [
              {'model': [SVC()], 
              'model__gamma': [0.01, 0.1, 1, 10, 100], 
              'model__C': [0.01, 0.1, 1, 10, 100]
              },

              {'model': [xgb.XGBClassifier()], 
              'model__learning_rate' : [0.1, 0.3, 0.5],
              'model__n_estimators' : [50, 100, 200,],  
              'model__max_depth': [3, 4, 6]
              },

              {'model': [RandomForestClassifier()],
              'model__max_depth': [3, 4], 
              'model__n_estimators': [100, 200], 
              'model__min_samples_split': [50, 100]
              }]        

grid = GridSearchCV(pipe, param_grid, scoring = 'roc_auc', cv=5)  
grid.fit(X_train, y_train)

print(grid.best_params_)
print(grid.best_score_)

{'model': XGBClassifier(base_score=0.5, booster='gbtree', colsample_bylevel=1,
              colsample_bynode=1, colsample_bytree=1, gamma=0,
              learning_rate=0.3, max_delta_step=0, max_depth=6,
              min_child_weight=1, missing=None, n_estimators=200, n_jobs=1,
              nthread=None, objective='binary:logistic', random_state=0,
              reg_alpha=0, reg_lambda=1, scale_pos_weight=1, seed=None,
              silent=None, subsample=1, verbosity=1), 'model__learning_rate': 0.3, 'model__max_depth': 6, 'model__n_estimators': 200}
0.8684761846778365

In [ ]:
grid.score(X_train, y_train)

1.0

In [ ]:
grid.score(X_val, y_val)

0.9866666666666668

In [ ]:
preds = grid.predict(X_val)

In [ ]:
from sklearn.metrics import roc_auc_score, classification_report

In [ ]:
print(classification_report(y_val, preds))

              precision    recall  f1-score   support

           0       0.95      1.00      0.97       195
           1       1.00      0.90      0.94       105

    accuracy                           0.96       300
   macro avg       0.97      0.95      0.96       300
weighted avg       0.97      0.96      0.96       300

In [ ]:

roc_auc_score(y_val, preds)

0.9476190476190476

In [ ]:
model = xgb.XGBClassifier(**grid.best_params_)

In [ ]:
model.fit(X_train, y_train)

XGBClassifier(base_score=0.5, booster='gbtree', colsample_bylevel=1,
              colsample_bynode=1, colsample_bytree=1, gamma=0,
              learning_rate=0.1, max_delta_step=0, max_depth=3,
              min_child_weight=1, missing=None,
              model=XGBClassifier(base_score=0.5, booster='gbtree',
                                  colsample_bylevel=1, colsample_bynode=1,
                                  colsample_bytree=1, gamma=0,
                                  learning_rate=0.3, max_delta_step=0,
                                  max_de...
                                  objective='binary:logistic', random_state=0,
                                  reg_alpha=0, reg_lambda=1, scale_pos_weight=1,
                                  seed=None, silent=None, subsample=1,
                                  verbosity=1),
              model__learning_rate=0.3, model__max_depth=6,
              model__n_estimators=200, n_estimators=100, n_jobs=1, nthread=None,
              objective='binary:logistic', random_state=0, reg_alpha=0,
              reg_lambda=1, scale_pos_weight=1, seed=None, silent=None,
              subsample=1, verbosity=1)

In [ ]:
y_test = model.predict_proba(test)[:, 1]

In [ ]:
test  = pd.read_csv('https://raw.githubusercontent.com/Datamanim/dataq/main/X_test.csv',encoding='euc-kr')

In [ ]:
answer = test[["cust_id", "gender"]]

In [ ]:
answer

In [ ]:
answer.to_csv("123456.csv", index=False)

In [ ]:
print(pd.read_csv("123456.csv"))

# 작업형 1

In [67]:
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/dataq/main/mtcars.csv',index_col=0)
df.head(2)

                mpg  cyl   disp   hp  drat     wt   qsec  vs  am  gear  carb
Mazda RX4      21.0    6  160.0  110   3.9  2.620  16.46   0   1     4     4
Mazda RX4 Wag  21.0    6  160.0  110   3.9  2.875  17.02   0   1     4     4

In [41]:
from sklearn.preprocessing import MinMaxScaler, StandardScaler

scaler = MinMaxScaler()
print(df["qsec"])
df["qsec"] = scaler.fit_transform(df[["qsec"]])
len(df[df["qsec"]>0.5])

Mazda RX4              16.46
Mazda RX4 Wag          17.02
Datsun 710             18.61
Hornet 4 Drive         19.44
Hornet Sportabout      17.02
Valiant                20.22
Duster 360             15.84
Merc 240D              20.00
Merc 230               22.90
Merc 280               18.30
Merc 280C              18.90
Merc 450SE             17.40
Merc 450SL             17.60
Merc 450SLC            18.00
Cadillac Fleetwood     17.98
Lincoln Continental    17.82
Chrysler Imperial      17.42
Fiat 128               19.47
Honda Civic            18.52
Toyota Corolla         19.90
Toyota Corona          20.01
Dodge Challenger       16.87
AMC Javelin            17.30
Camaro Z28             15.41
Pontiac Firebird       17.05
Fiat X1-9              18.90
Porsche 914-2          16.70
Lotus Europa           16.90
Ford Pantera L         14.50
Ferrari Dino           15.50
Maserati Bora          14.60
Volvo 142E             18.60
Name: qsec, dtype: float64

9

In [42]:
scaler = StandardScaler()
df["qsec"] = scaler.fit_transform(df[["qsec"]])
min, max = df["qsec"].min(), df["qsec"].max()
print(min, max)

-1.9039963517625216 2.871985538436861

In [43]:
Q1 = df["wt"].quantile(0.25) 
Q3 = df["wt"].quantile(0.75) 
iqr = Q3-Q1
iqr * 1.5 

Q1_iqr = df["wt"].quantile(0.25) - (iqr * 1.5 )
Q3_iqr = df["wt"].quantile(0.75) + (iqr * 1.5 )

df.wt[(df.wt <= Q1_iqr) | (df.wt >= Q3_iqr)].values

array([5.25 , 5.424, 5.345])

In [44]:
df.corr().iloc[1:, 0].to_frame().sort_values(by="mpg", ascending=False)

           mpg
drat  0.681172
vs    0.664039
am    0.599832
gear  0.480285
qsec  0.418684
carb -0.550925
hp   -0.776168
disp -0.847551
cyl  -0.852162
wt   -0.867659

In [68]:
import numpy as np
df = df.iloc[:, 1:]

In [69]:
columns_names = df.columns.tolist()
columns_names

['cyl', 'disp', 'hp', 'drat', 'wt', 'qsec', 'vs', 'am', 'gear', 'carb']

In [73]:
from sklearn.decomposition import PCA
scale = StandardScaler()
df = scaler.fit_transform(df)


componentsNum = 10 
pca  = PCA(n_components=componentsNum)
pca_df = pca.fit_transform(df)
pd.DataFrame(pca_df, columns=columns_names)

         cyl      disp        hp  ...        am      gear      carb
0   0.632134  1.739877 -0.665110  ... -0.177965 -0.067495 -0.163161
1   0.605027  1.554343 -0.434619  ... -0.085054 -0.125251 -0.071543
2   2.801549 -0.122632 -0.414510  ... -0.084116  0.162350  0.181756
3   0.259204 -2.364265 -0.095090  ... -0.188187 -0.101924 -0.166531
4  -2.032508 -0.774822 -1.016381  ...  0.116682 -0.108244 -0.181168
5   0.204867 -2.778790  0.093328  ... -0.045932 -0.154474  0.033869
6  -2.846324  0.318210 -0.324108  ...  0.179319  0.362386 -0.195036
7   1.938647 -1.454239  0.955656  ... -0.374506  0.239646 -0.031233
8   2.300271 -1.963602  1.751220  ...  0.935339 -0.061213 -0.130912
9   0.636986 -0.150858  1.434045  ... -0.543588 -0.260493  0.124549
10  0.712003 -0.308009  1.571549  ... -0.340193 -0.343927  0.071815
11 -2.168500 -0.698349 -0.318649  ...  0.091823 -0.060831  0.389843
12 -2.013998 -0.698920 -0.409019  ...  0.288854 -0.115464  0.184484
13 -1.983030 -0.811307 -0.297320  ...  0.405446 -0.167143  0.176943
14 -3.540037 -0.841191  0.646830  ... -0.234988  0.052358 -0.258041
15 -3.597893 -0.747153  0.725851  ... -0.248904  0.121949 -0.036876
16 -3.493731 -0.445347  0.702793  ... -0.182902  0.201483  0.145296
17  3.329571 -0.292943 -0.277423  ...  0.070160 -0.116413  0.129409
18  3.883988  0.704290 -0.202656  ... -0.133756 -0.228625 -0.282043
19  3.636227 -0.276133 -0.292044  ...  0.365579 -0.231154 -0.056534
20  1.962264 -2.101797  0.030140  ...  0.306503  0.606158 -0.031204
21 -2.048033 -1.026281 -1.177374  ... -0.162343 -0.117839 -0.019935
22 -1.682576 -0.913388 -1.014237  ...  0.061937 -0.246339  0.014154
23 -2.658623  0.669277 -0.184127  ... -0.017670  0.359389  0.101728
24 -2.354816 -0.899123 -0.869987  ... -0.079515 -0.075497 -0.191597
25  3.358263 -0.103399 -0.514251  ... -0.022693 -0.058105  0.031465
26  2.440051  2.057439 -0.881101  ...  0.014321  0.403521  0.121686
27  2.946328  1.383718 -0.355847  ... -0.239450  0.166930 -0.100088
28 -1.212566  3.498277 -0.197467  ...  0.153216 -0.426021  0.129397
29  0.014182  3.221361  0.374340  ... -0.114836  0.137882 -0.052590
30 -2.541137  4.366990  1.428770  ...  0.456812  0.026336 -0.091492
31  2.512210  0.258768  0.226798  ... -0.169392  0.226064  0.223587

[32 rows x 10 columns]

In [72]:
componentDf = pd.DataFrame(pca.explained_variance_ratio_,columns=['cumsumVariance']).cumsum().reset_index()

componentDf['index'] +=1

componentDf

   index  cumsumVariance
0      1        0.576022
1      2        0.840986
2      3        0.900708

In [3]:
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/dataq/main/mtcars.csv',index_col=0)

from sklearn.preprocessing import StandardScaler
from sklearn.decomposition import PCA

scaler = StandardScaler()
df = scaler.fit_transform(df)
pca = PCA()
pca_df = pca.fit_transform(df)
pd.DataFrame(pca.explained_variance_ratio_).cumsum()

           0
0   0.600764
1   0.841715
2   0.898733
3   0.923242
4   0.943556
5   0.962792
6   0.975088
7   0.986261
8   0.993265
9   0.997996
10  1.000000

In [85]:
pca.explained_variance_ratio_.cumsum()

array([0.60076366, 0.84171529, 0.89873322, 0.92324208, 0.94355581,
       0.96279183, 0.97508837, 0.98626123, 0.99326547, 0.99799596])

In [ ]:
dir(st)

In [ ]:
# t-test
# 모집단의 분산이나 표준편차를 알지 못할 때
# 모집단을 대표하는 표본으로부터 추정된 분산이나 표준편차를 가지고 검정하는 방법

# one_smaple_t_test
import scipy.stats as st 
coinflips = np.random.binomial(n = 1, p = 0.5, size = 1000)

print(st.ttest_1samp(coinflips, 0.5))

# two_smaple_t_test
coin1 = np.random.binomial(n = 1, p = 0.6, size = 500)
coin2 = np.random.binomial(n = 1, p = 0.5, size = 200)

st.ttest_ind(coin1, coin2)

Ttest_1sampResult(statistic=0.6322656909571999, pvalue=0.5273579504134063)

Ttest_indResult(statistic=1.9445586796700236, pvalue=0.05222945280717049)

In [ ]:
import numpy as np
from scipy.stats import chisquare  

s_obs = np.array([[18, 22, 20, 15, 23, 22]]) # Similar
print('--- Similar ---')
chisquare(s_obs, axis=None)

# st.chi2_contingency(데이터프레임으로 들어와야함)

# return으로는 chi2, pvalue, dof, expected가 주어지게 됨

--- Similar ---

Power_divergenceResult(statistic=2.3000000000000003, pvalue=0.8062668698851285)

In [ ]:
# 신뢰구간 ( T분포 )

import scipy.stats as st
import numpy as np

a = range(10, 14)
print(st.t.interval(0.95, len(a)-1, loc=np.mean(a), scale=st.sem(a)))


from scipy.stats import t
# 표본의 크기
n = len(a)
# 자유도
dof = n-1
# 평균의 평균
mean = np.mean(a)
# 표본의 표준편차
sample_std = np.std(a, ddof = 1)
# 표준 오차
std_err = sample_std / n ** 0.5 # sample_std / sqrt(n)

CI = t.interval(.95, dof, loc = mean, scale = std_err)
print(CI)

(9.445739743239121, 13.554260256760879)
(9.445739743239121, 13.554260256760879)

In [ ]:
# 신뢰구간 ( chi)

from scipy.stats 
import numpy as np

## 모집단 평균 70, 표준편차 3 가정
mu = 70
std = 3
norm_ = st.norm(mu,std)

## 모집단에서 30개 표본 추출
sample_data=norm_.rvs(30)
sample_mean = np.mean(sample_data)
sample_std = np.std(sample_data, ddof=1)

## 카이제곱분포를 활용한 신뢰구간 추정
df = 30-1
chi_ = st.chi2(df)
t_025 = chi_.ppf(0.025) 
t_975 = chi_.ppf(0.975) 
L_= round(((df*sample_std**2)/t_975),2) ## 본문의 식과는 t_975, t_025순서가 바뀜(Scipy가 주는 값에 의해)
U_= round(((df*sample_std**2)/t_025),2)
print("{} < {} < {}".format(L_, std**2, U_)) ## 결과:4.78 < 9 < 13.62

5.88 < 9 < 16.74

In [ ]:
# ANOVA
#: Python의  scipy 모듈의 stats.f_oneway() 메소드를 사용하여 샘플의 크기가 서로 다른 3개 그룹 간 평균에 차이가 존재하는지 여부를 일원분산분석(one-way ANOVA)

# [ 분산분석  검정의 가정사항 (assumptions of ANOVA test) ]

#   (1) 독립성: 각 샘플 데이터는 서로 독립이다. 
#   (2) 정규성: 각 샘플 데이터는 정규분포를 따르는 모집단으로 부터 추출되었다. 
#   (3) 등분산성: 그룹들의 모집단의 분산은 모두 동일하다. 

import scipy.stats as st

d1 = np.random.normal(0, 1, 50)
d2 = np.random.normal(0, 1, 40)
d3 = np.random.normal(5, 1, 30)

print(st.f_oneway(d1, d2, d3))

f_val, p_val = st.f_oneway(d1, d2, d3)
print('f-statistic:', f_val.round(5))
print('p-vale:', p_val)

F_onewayResult(statistic=239.1906104982351, pvalue=4.60635778812442e-42)
f-statistic: 239.19061
p-vale: 4.60635778812442e-42

# Pandas Tutorial

In [ ]:
# 데이터를 로드하라. 데이터는 \t을 기준으로 구분되어있다.
import pandas as pd
url ="https://raw.githubusercontent.com/Datamanim/pandas/main/lol.csv"
df=pd.read_csv(url, sep="\t")
df.head(5)

       gameId   creationTime  gameDuration  ...  t2_ban3  t2_ban4  t2_ban5
0  3326086514  1504279457970          1949  ...       43       16       51
1  3229566029  1497848803862          1851  ...      238       51      420
2  3327363504  1504360103310          1493  ...      121       57       28
3  3326856598  1504348503996          1758  ...      141       40       51
4  3330080762  1504554410899          2094  ...      201      122       18

[5 rows x 61 columns]

In [ ]:
# 데이터의 행과 열의 갯수를 파악하라
print("행", df.shape[0])
print("열", df.shape[1])

행 51490
열 61

In [ ]:
# 전체 컬럼을 출력하라
df.columns

Index(['gameId', 'creationTime', 'gameDuration', 'seasonId', 'winner',
       'firstBlood', 'firstTower', 'firstInhibitor', 'firstBaron',
       'firstDragon', 'firstRiftHerald', 't1_champ1id', 't1_champ1_sum1',
       't1_champ1_sum2', 't1_champ2id', 't1_champ2_sum1', 't1_champ2_sum2',
       't1_champ3id', 't1_champ3_sum1', 't1_champ3_sum2', 't1_champ4id',
       't1_champ4_sum1', 't1_champ4_sum2', 't1_champ5id', 't1_champ5_sum1',
       't1_champ5_sum2', 't1_towerKills', 't1_inhibitorKills', 't1_baronKills',
       't1_dragonKills', 't1_riftHeraldKills', 't1_ban1', 't1_ban2', 't1_ban3',
       't1_ban4', 't1_ban5', 't2_champ1id', 't2_champ1_sum1', 't2_champ1_sum2',
       't2_champ2id', 't2_champ2_sum1', 't2_champ2_sum2', 't2_champ3id',
       't2_champ3_sum1', 't2_champ3_sum2', 't2_champ4id', 't2_champ4_sum1',
       't2_champ4_sum2', 't2_champ5id', 't2_champ5_sum1', 't2_champ5_sum2',
       't2_towerKills', 't2_inhibitorKills', 't2_baronKills', 't2_dragonKills',
       't2_riftHeraldKills', 't2_ban1', 't2_ban2', 't2_ban3', 't2_ban4',
       't2_ban5'],
      dtype='object')

In [ ]:
# 6번째 컬럼명을 출력하라
df.columns[5]

'firstBlood'

In [ ]:
# 데이터셋의 인덱스 구성은 어떤가
df.index

RangeIndex(start=0, stop=51490, step=1)

In [ ]:
df.iloc[2,5]

2

In [ ]:
url1 = "https://raw.githubusercontent.com/Datamanim/pandas/main/Jeju.csv"

df1 = pd.read_csv(url1, encoding = "euc-kr")
df1

         id          일자   시도명  읍면동명  ...  평균 소요 시간  평균 기온  일강수량  평균 풍속
0     22448  2018-01-01   제주시   도두동  ...    29.167    5.0   0.0   2.50
1     22449  2018-01-01   제주시   외도동  ...    30.900    5.0   0.0   2.50
2     22450  2018-01-01   제주시  이도2동  ...    35.692    2.9   0.0   2.40
3     22451  2018-01-01   제주시  일도1동  ...    23.500    2.9   0.0   2.40
4     22452  2018-01-01  서귀포시   대천동  ...    14.375    5.1   0.0   2.30
...     ...         ...   ...   ...  ...       ...    ...   ...    ...
9616  32064  2020-04-30  서귀포시   표선면  ...    34.054   18.1   0.0   4.70
9617  32065  2020-04-30   제주시   한림읍  ...    61.377   18.0   0.0   4.35
9618  32066  2020-04-30   제주시   도두동  ...    29.421   20.3   0.0   3.00
9619  32067  2020-04-30  서귀포시   안덕면  ...    49.189   17.6   0.0   3.50
9620  32068  2020-04-30   제주시    연동  ...    27.765   14.1   0.0   4.80

[9621 rows x 13 columns]

In [ ]:
# 데이터 마지막 3개행을 출력하라
df.tail(3)

           gameId   creationTime  gameDuration  ...  t2_ban3  t2_ban4  t2_ban5
51487  3322765040  1504029863961          2156  ...       53       11      157
51488  3256675373  1499562036246          1475  ...       51       90      114
51489  3317333020  1503612754059          1445  ...      141       31       18

[3 rows x 61 columns]

In [ ]:
# 수치형 변수를 가진 컬럼을 출력하라
df1.select_dtypes(exclude=object).columns

Index(['id', '거주인구', '근무인구', '방문인구', '총 유동인구', '평균 속도', '평균 소요 시간', '평균 기온',
       '일강수량', '평균 풍속'],
      dtype='object')

In [ ]:
# 범주형 변수를 가진 컬럼을 출력하라
df1.select_dtypes(include=object).columns

Index(['일자', '시도명', '읍면동명'], dtype='object')

In [ ]:
df1.isnull().sum()

id          0
일자          0
시도명         0
읍면동명        0
거주인구        0
근무인구        0
방문인구        0
총 유동인구      0
평균 속도       0
평균 소요 시간    0
평균 기온       0
일강수량        0
평균 풍속       0
dtype: int64

In [ ]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9621 entries, 0 to 9620
Data columns (total 13 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   id        9621 non-null   int64
 1   일자        9621 non-null   object
 2   시도명       9621 non-null   object
 3   읍면동명      9621 non-null   object
 4   거주인구      9621 non-null   float64
 5   근무인구      9621 non-null   float64
 6   방문인구      9621 non-null   float64
 7   총 유동인구    9621 non-null   float64
 8   평균 속도     9621 non-null   float64
 9   평균 소요 시간  9621 non-null   float64
 10  평균 기온     9621 non-null   float64
 11  일강수량      9621 non-null   float64
 12  평균 풍속     9621 non-null   float64
dtypes: float64(9), int64(1), object(3)
memory usage: 977.3+ KB

In [ ]:
df1.describe()

                 id          거주인구  ...         일강수량        평균 풍속
count   9621.000000  9.621000e+03  ...  9621.000000  9621.000000
mean   27258.000000  3.174315e+05  ...     6.972426     2.753171
std     2777.487804  2.982079e+05  ...    27.617260     1.498538
min    22448.000000  9.305552e+03  ...     0.000000     0.000000
25%    24853.000000  9.539939e+04  ...     0.000000     1.700000
50%    27258.000000  2.221105e+05  ...     0.000000     2.400000
75%    29663.000000  4.106671e+05  ...     1.500000     3.400000
max    32068.000000  1.364504e+06  ...   587.500000    13.333000

[8 rows x 10 columns]

In [ ]:
df1["거주인구"]

0         32249.987
1        213500.997
2       1212382.218
3         33991.653
4        155036.925
           ...
9616     228260.005
9617     459959.064
9618      28397.481
9619     348037.846
9620    1010643.372
Name: 거주인구, Length: 9621, dtype: float64

In [ ]:
df1["평균 속도"].quantile(0.75) - df1["평균 속도"].quantile(0.25)

14.854999999999997

In [ ]:
# 읍면동명 컬럼의 유일값 갯수를 출력하라
df1.읍면동명.nunique()

41

In [ ]:
df1.nunique()

id          9621
일자           803
시도명            2
읍면동명          41
거주인구        9621
근무인구        9621
방문인구        9621
총 유동인구      9621
평균 속도       3345
평균 소요 시간    4046
평균 기온       1324
일강수량         506
평균 풍속        439
dtype: int64

In [ ]:
# 읍면동명 컬럼의 유일값을 모두 출력하라
df1.읍면동명.unique()

array(['도두동', '외도동', '이도2동', '일도1동', '대천동', '서홍동', '한경면', '송산동', '조천읍',
       '일도2동', '영천동', '예래동', '대륜동', '삼도1동', '이호동', '건입동', '중앙동', '삼양동',
       '삼도2동', '이도1동', '남원읍', '대정읍', '정방동', '효돈동', '아라동', '한림읍', '구좌읍',
       '용담1동', '오라동', '화북동', '연동', '표선면', '중문동', '성산읍', '안덕면', '천지동',
       '노형동', '동홍동', '용담2동', '봉개동', '애월읍'], dtype=object)

In [ ]:
url2 = 'https://raw.githubusercontent.com/Datamanim/pandas/main/chipo.csv'
df = pd.read_csv(url2)
Ans = type(df)

In [ ]:
Ans

pandas.core.frame.DataFrame

In [ ]:
# quantity컬럼 값이 3인 데이터를 추출하여 첫 5행을 출력하라
df[df["quantity"]==3].head(5)

     order_id  ...  item_price
409       178  ...     $32.94
445       193  ...     $22.20
689       284  ...      $3.75
818       338  ...      $3.27
850       350  ...      $3.75

[5 rows x 5 columns]

In [ ]:
# quantity컬럼 값이 3인 데이터를 추출하여 index를 0부터 정렬하고 첫 5행을 출력하라
df[df["quantity"]==3].reset_index(drop=False)

    index  ...  item_price
0     409  ...     $32.94
1     445  ...     $22.20
2     689  ...      $3.75
3     818  ...      $3.27
4     850  ...      $3.75
5     917  ...      $3.75
6    1255  ...     $27.75
7    1514  ...     $26.25
8    1559  ...      $3.75
9    2645  ...     $13.35
10   2823  ...      $3.27
11   2936  ...      $6.45
12   2944  ...      $5.07
13   2972  ...      $7.17
14   3089  ...      $3.75
15   3128  ...      $3.75
16   3270  ...      $7.17
17   3294  ...      $4.50
18   3314  ...      $4.50
19   3334  ...     $26.07
20   3480  ...     $35.25
21   3601  ...     $33.75
22   3603  ...     $27.75
23   3634  ...     $26.25
24   3636  ...     $26.25
25   4098  ...      $3.75
26   4137  ...      $4.50
27   4186  ...      $4.50

[28 rows x 6 columns]

In [ ]:
df[["quantity", "item_price"]]

      quantity item_price
0            1     $2.39
1            1     $3.39
2            1     $3.39
3            1     $2.39
4            2    $16.98
...        ...        ...
4617         1    $11.75
4618         1    $11.75
4619         1    $11.25
4620         1     $8.75
4621         1     $8.75

[4622 rows x 2 columns]

In [ ]:
# item_price 컬럼의 달러표시 문자를 제거하고 float 타입으로 저장하여 new_price 컬럼에 저장하라
data = df["item_price"].str[1:].astype("float")
df["new_price"] = data
df

      order_id  quantity  ... item_price new_price
0            1         1  ...     $2.39       2.39
1            1         1  ...     $3.39       3.39
2            1         1  ...     $3.39       3.39
3            1         1  ...     $2.39       2.39
4            2         2  ...    $16.98      16.98
...        ...       ...  ...        ...       ...
4617      1833         1  ...    $11.75      11.75
4618      1833         1  ...    $11.75      11.75
4619      1834         1  ...    $11.25      11.25
4620      1834         1  ...     $8.75       8.75
4621      1834         1  ...     $8.75       8.75

[4622 rows x 6 columns]

In [ ]:
# new_price 컬럼이 5이하의 값을 가지는 데이터프레임을 추출하고, 전체 갯수를 구하여라
len(df[df["new_price"] <= 5])

1652

In [ ]:
df[df["item_name"] == "Chicken Salad Bowl"].reset_index(drop=True)

     order_id  quantity  ... item_price new_price
0          20         1  ...     $8.75       8.75
1          60         2  ...    $22.50      22.50
2          94         2  ...    $22.50      22.50
3         111         1  ...     $8.75       8.75
4         137         2  ...    $17.50      17.50
..        ...       ...  ...        ...       ...
105      1813         2  ...    $17.50      17.50
106      1822         1  ...    $11.25      11.25
107      1834         1  ...    $11.25      11.25
108      1834         1  ...     $8.75       8.75
109      1834         1  ...     $8.75       8.75

[110 rows x 6 columns]

In [ ]:
df[(df.new_price<=9) & (df.item_name == "Chicken Salad Bowl")].head(5)

     order_id  quantity  ... item_price new_price
44         20         1  ...     $8.75       8.75
256       111         1  ...     $8.75       8.75
526       220         1  ...     $8.75       8.75
528       221         1  ...     $8.75       8.75
529       221         1  ...     $8.75       8.75

[5 rows x 6 columns]

In [ ]:
df.sort_values("new_price").reset_index(drop=True)

      order_id  quantity  ... item_price new_price
0          471         1  ...     $1.09       1.09
1          338         1  ...     $1.09       1.09
2         1575         1  ...     $1.09       1.09
3           47         1  ...     $1.09       1.09
4         1014         1  ...     $1.09       1.09
...        ...       ...  ...        ...       ...
4617      1443         3  ...    $33.75      33.75
4618      1443         4  ...    $35.00      35.00
4619       511         4  ...    $35.00      35.00
4620      1398         3  ...    $35.25      35.25
4621      1443        15  ...    $44.25      44.25

[4622 rows x 6 columns]

In [ ]:
# df의 item_name 컬럼 값중 Chips 포함하는 경우의 데이터를 출력하라

df[df["item_name"].str.contains("Chips")]

      order_id  quantity  ... item_price new_price
0            1         1  ...     $2.39       2.39
3            1         1  ...     $2.39       2.39
6            3         1  ...     $1.69       1.69
10           5         1  ...     $4.45       4.45
14           7         1  ...     $4.45       4.45
...        ...       ...  ...        ...       ...
4596      1826         1  ...     $4.45       4.45
4600      1827         1  ...     $4.45       4.45
4605      1828         1  ...     $4.45       4.45
4613      1831         1  ...     $2.15       2.15
4616      1832         1  ...     $4.45       4.45

[1084 rows x 6 columns]

In [ ]:
# df의 짝수번째 컬럼만을 포함하는 데이터프레임을 출력하라
df.iloc[:, ::2]

      order_id                              item_name item_price
0            1           Chips and Fresh Tomato Salsa     $2.39
1            1                                   Izze     $3.39
2            1                       Nantucket Nectar     $3.39
3            1  Chips and Tomatillo-Green Chili Salsa     $2.39
4            2                           Chicken Bowl    $16.98
...        ...                                    ...        ...
4617      1833                          Steak Burrito    $11.75
4618      1833                          Steak Burrito    $11.75
4619      1834                     Chicken Salad Bowl    $11.25
4620      1834                     Chicken Salad Bowl     $8.75
4621      1834                     Chicken Salad Bowl     $8.75

[4622 rows x 3 columns]

In [ ]:
# df의 new_price 컬럼 값에 따라 내림차순으로 정리하고 index를 초기화 하여라
df.sort_values("new_price", ascending=False).reset_index(drop=True)

      order_id  quantity  ... item_price new_price
0         1443        15  ...    $44.25      44.25
1         1398         3  ...    $35.25      35.25
2          511         4  ...    $35.00      35.00
3         1443         4  ...    $35.00      35.00
4         1443         3  ...    $33.75      33.75
...        ...       ...  ...        ...       ...
4617      1578         1  ...     $1.09       1.09
4618      1162         1  ...     $1.09       1.09
4619       567         1  ...     $1.09       1.09
4620      1014         1  ...     $1.09       1.09
4621       591         1  ...     $1.09       1.09

[4622 rows x 6 columns]

In [ ]:
df[(df.item_name == "Steak Salad") | (df.item_name == "Bowl")]

      order_id  quantity  ... item_price new_price
445        193         3  ...    $22.20      22.20
664        276         1  ...     $8.99       8.99
673        279         1  ...     $7.40       7.40
752        311         1  ...     $8.99       8.99
893        369         1  ...     $8.99       8.99
3502      1406         1  ...     $8.69       8.69

[6 rows x 6 columns]

In [ ]:
df[(df.item_name == "Steak Salad") | (df.item_name == "Bowl")].drop_duplicates("item_name")

     order_id  quantity  ... item_price new_price
445       193         3  ...    $22.20      22.20
664       276         1  ...     $8.99       8.99

[2 rows x 6 columns]

In [ ]:
df[(df.item_name == "Steak Salad") | (df.item_name == "Bowl")].drop_duplicates("item_name", keep="last")

      order_id  quantity  ... item_price new_price
673        279         1  ...     $7.40       7.40
3502      1406         1  ...     $8.69       8.69

[2 rows x 6 columns]

In [ ]:
average = df["new_price"].mean()
df[df["new_price"] > average]

      order_id  quantity  ... item_price new_price
4            2         2  ...    $16.98      16.98
5            3         1  ...    $10.98      10.98
7            4         1  ...    $11.75      11.75
8            4         1  ...     $9.25       9.25
9            5         1  ...     $9.25       9.25
...        ...       ...  ...        ...       ...
4617      1833         1  ...    $11.75      11.75
4618      1833         1  ...    $11.75      11.75
4619      1834         1  ...    $11.25      11.25
4620      1834         1  ...     $8.75       8.75
4621      1834         1  ...     $8.75       8.75

[2890 rows x 6 columns]

In [ ]:
df[df.new_price >= df.new_price.mean()]

      order_id  quantity  ... item_price new_price
4            2         2  ...    $16.98      16.98
5            3         1  ...    $10.98      10.98
7            4         1  ...    $11.75      11.75
8            4         1  ...     $9.25       9.25
9            5         1  ...     $9.25       9.25
...        ...       ...  ...        ...       ...
4617      1833         1  ...    $11.75      11.75
4618      1833         1  ...    $11.75      11.75
4619      1834         1  ...    $11.25      11.25
4620      1834         1  ...     $8.75       8.75
4621      1834         1  ...     $8.75       8.75

[2890 rows x 6 columns]

In [ ]:
df[df["item_name"] == "Izze"] = "Fizzy Lizzy"
df.head(5)

      order_id     quantity  ...   item_price    new_price
0            1            1  ...       $2.39          2.39
1  Fizzy Lizzy  Fizzy Lizzy  ...  Fizzy Lizzy  Fizzy Lizzy
2            1            1  ...       $3.39          3.39
3            1            1  ...       $2.39          2.39
4            2            2  ...      $16.98         16.98

[5 rows x 6 columns]

In [ ]:
df["choice_description"] = df["choice_description"].fillna("NoData")
df["choice_description"]

0                                                  NoData
1                                             Fizzy Lizzy
2                                                 [Apple]
3                                                  NoData
4       [Tomatillo-Red Chili Salsa (Hot), [Black Beans...
                              ...
4617    [Fresh Tomato Salsa, [Rice, Black Beans, Sour ...
4618    [Fresh Tomato Salsa, [Rice, Sour Cream, Cheese...
4619    [Fresh Tomato Salsa, [Fajita Vegetables, Pinto...
4620    [Fresh Tomato Salsa, [Fajita Vegetables, Lettu...
4621    [Fresh Tomato Salsa, [Fajita Vegetables, Pinto...
Name: choice_description, Length: 4622, dtype: object

In [ ]:
df[df.choice_description.str.contains("Black")].head(5)

   order_id quantity  ... item_price new_price
4         2        2  ...    $16.98      16.98
7         4        1  ...    $11.75      11.75
9         5        1  ...     $9.25       9.25
11        6        1  ...     $8.75       8.75
12        6        1  ...     $8.75       8.75

[5 rows x 6 columns]

In [ ]:
len(df.loc[~df.choice_description.str.contains("Vegetables")])

3900

In [ ]:
df[df.item_name.str.startswith("N")].head(3)

    order_id quantity  ... item_price new_price
2          1        1  ...     $3.39       3.39
22        11        1  ...     $3.39       3.39
105       46        1  ...     $3.39       3.39

[3 rows x 6 columns]

In [ ]:
df[df.item_name.str.len() >= 15].head()

   order_id quantity  ... item_price new_price
0         1        1  ...     $2.39       2.39
2         1        1  ...     $3.39       3.39
3         1        1  ...     $2.39       2.39
8         4        1  ...     $9.25       9.25
10        5        1  ...     $4.45       4.45

[5 rows x 6 columns]

In [ ]:
lst =[1.69, 2.39, 3.39, 4.45, 9.25, 10.98, 11.75, 16.98]

df.loc[df.new_price.isin(lst)].head(3)

  order_id quantity  ... item_price new_price
0        1        1  ...     $2.39       2.39
2        1        1  ...     $3.39       3.39
3        1        1  ...     $2.39       2.39

[3 rows x 6 columns]

### Grouping

In [ ]:
df= pd.read_csv('https://raw.githubusercontent.com/Datamanim/pandas/main/AB_NYC_2019.csv')

Ans =df.head(5)

In [ ]:
df

             id  ... availability_365
0          2539  ...              365
1          2595  ...              355
2          3647  ...              365
3          3831  ...              194
4          5022  ...                0
...         ...  ...              ...
48890  36484665  ...                9
48891  36485057  ...               36
48892  36485431  ...               27
48893  36485609  ...                2
48894  36487245  ...               23

[48895 rows x 16 columns]

In [ ]:
Ans = df.groupby('host_name').size()

# or

Ans = df.host_name.value_counts().sort_index()

In [ ]:
# 데이터의 각 host_name의 빈도수를 구하고 빈도수 기준 내림차순 정렬한 데이터 프레임을 만들어라. 빈도수 컬럼은 counts로 명명하라
df.host_name.value_counts().to_frame().rename(columns={"host_name":"counts"})

                    counts
Michael                417
David                  403
Sonder (NYC)           327
John                   294
Alex                   279
...                    ...
Citlali                  1
Mohd Tahmid              1
Kraig                    1
Fernando And Lenin       1
Erdi                     1

[11452 rows x 1 columns]

In [ ]:
df.groupby(["neighbourhood_group", "neighbourhood"]).size()

neighbourhood_group  neighbourhood
Bronx                Allerton         42
                     Baychester        7
                     Belmont          24
                     Bronxdale        19
                     Castle Hill       9
                                      ..
Staten Island        Tottenville       7
                     West Brighton    18
                     Westerleigh       2
                     Willowbrook       1
                     Woodrow           1
Length: 221, dtype: int64

In [ ]:
Ans= df.groupby(['neighbourhood_group','neighbourhood'], as_index=False).size()\
                  .groupby(['neighbourhood_group'], as_index=False).max()
Ans

  neighbourhood_group    neighbourhood  size
0               Bronx         Woodlawn    70
1            Brooklyn  Windsor Terrace  3920
2           Manhattan     West Village  2658
3              Queens         Woodside   900
4       Staten Island          Woodrow    48

In [ ]:
df.groupby("neighbourhood_group")["price"].agg(["mean", "var", "max", "min"])

                           mean           var    max  min
neighbourhood_group
Bronx                 87.496792  11386.885081   2500    0
Brooklyn             124.383207  34921.719135  10000    0
Manhattan            196.875814  84904.159185  10000    0
Queens                99.517649  27923.130227  10000   10
Staten Island        114.812332  77073.088342   5000   13

In [ ]:
df[['neighbourhood_group','price']].groupby('neighbourhood_group').agg(['mean','var','max','min'])

                          price
                           mean           var    max min
neighbourhood_group
Bronx                 87.496792  11386.885081   2500   0
Brooklyn             124.383207  34921.719135  10000   0
Manhattan            196.875814  84904.159185  10000   0
Queens                99.517649  27923.130227  10000  10
Staten Island        114.812332  77073.088342   5000  13

In [ ]:
df.groupby("neighbourhood_group")["reviews_per_month"].agg(["mean", "var", "max", "min"])

                         mean       var    max   min
neighbourhood_group
Bronx                1.837831  2.799878  10.34  0.02
Brooklyn             1.283212  2.299040  14.00  0.01
Manhattan            1.272131  2.651206  58.50  0.01
Queens               1.941200  4.897848  20.94  0.01
Staten Island        1.872580  2.840895  10.12  0.02

In [ ]:
df.groupby(["neighbourhood", "neighbourhood_group"]).price.mean()

neighbourhood    neighbourhood_group
Allerton         Bronx                   87.595238
Arden Heights    Staten Island           67.250000
Arrochar         Staten Island          115.000000
Arverne          Queens                 171.779221
Astoria          Queens                 117.187778
                                           ...
Windsor Terrace  Brooklyn               138.993631
Woodhaven        Queens                  67.170455
Woodlawn         Bronx                   60.090909
Woodrow          Staten Island          700.000000
Woodside         Queens                  85.097872
Name: price, Length: 221, dtype: float64

In [ ]:
df.groupby(["neighbourhood", "neighbourhood_group"]).price.mean().unstack()

neighbourhood_group      Bronx    Brooklyn  ...      Queens  Staten Island
neighbourhood                               ...
Allerton             87.595238         NaN  ...         NaN            NaN
Arden Heights              NaN         NaN  ...         NaN          67.25
Arrochar                   NaN         NaN  ...         NaN         115.00
Arverne                    NaN         NaN  ...  171.779221            NaN
Astoria                    NaN         NaN  ...  117.187778            NaN
...                        ...         ...  ...         ...            ...
Windsor Terrace            NaN  138.993631  ...         NaN            NaN
Woodhaven                  NaN         NaN  ...   67.170455            NaN
Woodlawn             60.090909         NaN  ...         NaN            NaN
Woodrow                    NaN         NaN  ...         NaN         700.00
Woodside                   NaN         NaN  ...   85.097872            NaN

[221 rows x 5 columns]

In [ ]:
df.groupby(["neighbourhood", "neighbourhood_group"]).price.mean().unstack().fillna(-999)

neighbourhood_group       Bronx    Brooklyn  ...      Queens  Staten Island
neighbourhood                                ...
Allerton              87.595238 -999.000000  ... -999.000000        -999.00
Arden Heights       -999.000000 -999.000000  ... -999.000000          67.25
Arrochar            -999.000000 -999.000000  ... -999.000000         115.00
Arverne             -999.000000 -999.000000  ...  171.779221        -999.00
Astoria             -999.000000 -999.000000  ...  117.187778        -999.00
...                         ...         ...  ...         ...            ...
Windsor Terrace     -999.000000  138.993631  ... -999.000000        -999.00
Woodhaven           -999.000000 -999.000000  ...   67.170455        -999.00
Woodlawn              60.090909 -999.000000  ... -999.000000        -999.00
Woodrow             -999.000000 -999.000000  ... -999.000000         700.00
Woodside            -999.000000 -999.000000  ...   85.097872        -999.00

[221 rows x 5 columns]

In [ ]:
df[df.neighbourhood_group.str.contains("Queens")].groupby("neighbourhood").price.agg(["mean", "var", "min", "max"]).head(3)

                     mean            var  min    max
neighbourhood
Arverne        171.779221   37383.411141   35   1500
Astoria        117.187778  122428.811196   25  10000
Bay Terrace    142.000000    6816.400000   32    258

In [ ]:
ans = df[["neighbourhood_group", "room_type"]].groupby(["neighbourhood_group", "room_type"]).size().unstack()
ans.loc[:, :] = ans.values / ans.sum(axis=1).values.reshape(-1, 1)
ans

KeyError: ignored

### Apply, Map

In [ ]:
url = "https://raw.githubusercontent.com/Datamanim/pandas/main/BankChurnersUp.csv"

df = pd.read_csv(url)

In [ ]:
dic = {
    'Unknown'        : 'N',
    'Less than $40K' : 'a',
    '$40K - $60K'    : 'b',
    '$60K - $80K'    : 'c',
    '$80K - $120K'   : 'd',
    '$120K +'        : 'e'   
}

df["newIncome"] = df.Income_Category.map(lambda x: dic[x])
df["newIncome"]

0        c
1        a
2        d
3        a
4        c
        ..
10122    b
10123    b
10124    a
10125    b
10126    a
Name: newIncome, Length: 10127, dtype: object

In [ ]:
df['AgeState']  = df.Customer_Age.map(lambda x: x//10 *10)
df['AgeState'].value_counts().sort_index()

20     195
30    1841
40    4561
50    2998
60     530
70       2
Name: AgeState, dtype: int64

In [ ]:
df["Education_Level"] = df["Education_Level"].map(lambda x : 1 if "Graduate" in x else 0)
df["Education_Level"].value_counts()

0    6483
1    3644
Name: Education_Level, dtype: int64

In [ ]:
df["newLimit "] = df["Credit_Limit"].map(lambda x : 1 if x >=4500 else 0)
df["newLimit "].value_counts()

1    5096
0    5031
Name: newLimit , dtype: int64

In [ ]:
def check(x):
  if (x.Marital_Status == "Married") & (x.Card_Category == "Platinum"):
    return 1 
  else:
    return 0 

df['newState'] = df.apply(check, axis=1)
df['newState'].value_counts()

0    10120
1        7
Name: newState, dtype: int64

In [ ]:
df["Gender"]

0        M
1        F
2        M
3        F
4        M
        ..
10122    M
10123    M
10124    F
10125    M
10126    F
Name: Gender, Length: 10127, dtype: object

In [ ]:
df[df["Gender"] == "M"] = "male"
df[df["Gender"] == "F"] = "female"
df["Gender"]

0          male
1        female
2          male
3        female
4          male
          ...
10122      male
10123      male
10124    female
10125      male
10126    female
Name: Gender, Length: 10127, dtype: object

In [ ]:
url = "https://raw.githubusercontent.com/Datamanim/pandas/main/timeTest.csv"
df = pd.read_csv(url)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6574 entries, 0 to 6573
Data columns (total 13 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Yr_Mo_Dy  6574 non-null   object
 1   RPT       6568 non-null   float64
 2   VAL       6571 non-null   float64
 3   ROS       6572 non-null   float64
 4   KIL       6569 non-null   float64
 5   SHA       6572 non-null   float64
 6   BIR       6574 non-null   float64
 7   DUB       6571 non-null   float64
 8   CLA       6572 non-null   float64
 9   MUL       6571 non-null   float64
 10  CLO       6573 non-null   float64
 11  BEL       6574 non-null   float64
 12  MAL       6570 non-null   float64
dtypes: float64(12), object(1)
memory usage: 667.8+ KB

In [ ]:
df.head(2)

     Yr_Mo_Dy    RPT    VAL    ROS   KIL  ...    CLA    MUL    CLO    BEL    MAL
0  2061-01-01  15.04  14.96  13.17  9.29  ...  10.25  10.83  12.58  18.50  15.04
1  2061-01-02  14.71    NaN  10.83  6.50  ...  10.04   9.79   9.67  17.54  13.83

[2 rows x 13 columns]

In [ ]:
print(df["Yr_Mo_Dy"].dtypes)
df["Yr_Mo_Dy"] = df["Yr_Mo_Dy"].astype("datetime64[ns]")
print(df["Yr_Mo_Dy"].dtypes)

object
datetime64[ns]

In [ ]:
print(df["Yr_Mo_Dy"].dtypes)
df["Yr_Mo_Dy"] = pd.to_datetime(df["Yr_Mo_Dy"])
print(df["Yr_Mo_Dy"].dtypes)

In [ ]:
df["Yr_Mo_Dy"].dt.year.unique()

array([2061, 2062, 2063, 2064, 2065, 2066, 2067, 2068, 2069, 2070, 1971,
       1972, 1973, 1974, 1975, 1976, 1977, 1978])

In [ ]:
def fix_century(x):
  import datetime
  
  year = x.year - 100 if x.year > 1989 else x.year
  return pd.to_datetime(datetime.date(year, x.month, x.day))

df["Yr_Mo_Dy"] = df["Yr_Mo_Dy"].apply(fix_century)

df.head(4)

    Yr_Mo_Dy    RPT    VAL    ROS    KIL  ...    CLA    MUL    CLO    BEL    MAL
0 1961-01-01  15.04  14.96  13.17   9.29  ...  10.25  10.83  12.58  18.50  15.04
1 1961-01-02  14.71    NaN  10.83   6.50  ...  10.04   9.79   9.67  17.54  13.83
2 1961-01-03  18.50  16.88  12.33  10.13  ...    NaN   8.50   7.67  12.75  12.71
3 1961-01-04  10.58   6.63  11.75   4.58  ...   1.79   5.83   5.88   5.46  10.88

[4 rows x 13 columns]

In [ ]:
df.groupby(df["Yr_Mo_Dy"].dt.year).mean()

                RPT        VAL        ROS  ...        CLO        BEL        MAL
Yr_Mo_Dy                                   ...
1961      12.299583  10.351796  11.362369  ...   9.835577  13.502795  13.680773
1962      12.246923  10.110438  11.732712  ...   9.676247  12.930685  14.323956
1963      12.813452  10.836986  12.541151  ...  10.224438  13.638877  14.999014
1964      12.363661  10.920164  12.104372  ...  10.207951  13.740546  14.910301
1965      12.451370  11.075534  11.848767  ...   9.918082  12.964247  15.591644
1966      13.461973  11.557205  12.020630  ...   9.768959  14.265836  16.307260
1967      12.737151  10.990986  11.739397  ...   9.547425  14.774548  17.135945
1968      11.835628  10.468197  11.409754  ...   7.832978  12.808634  15.017486
1969      11.166356   9.723699  10.902000  ...   7.754384  12.621233  15.762904
1970      12.600329  10.726932  11.730247  ...   8.289808  13.183644  16.456027
1971      11.273123   9.095178  11.088329  ...   7.229753  12.208932  15.025233
1972      12.463962  10.561311  12.058333  ...   7.515273  12.727377  15.028716
1973      11.828466  10.680493  10.680493  ...   7.812411  12.169699  15.441096
1974      13.643096  11.811781  12.336356  ...   8.736356  13.252959  16.947671
1975      12.008575  10.293836  11.564712  ...   7.382822  12.631671  15.307863
1976      11.737842  10.203115  10.761230  ...   7.883087  12.332377  15.471448
1977      13.099616  11.144493  12.627836  ...   8.821616  13.459068  16.590849
1978      12.504356  11.044274  11.380000  ...   8.301699  12.967397  16.771370

[18 rows x 12 columns]

In [ ]:
df["weekday"] = df.Yr_Mo_Dy.dt.weekday
df["weekday"].head(3).to_frame()

   weekday
0        6
1        0
2        1

In [ ]:
df['WeekCheck']  = df['weekday'].map(lambda x : 1 if x in [5,6] else 0)

Ans = df['WeekCheck'].head(3).to_frame()

In [ ]:
# 모든 결측치는 컬럼기준 직전의 값으로 대체하고 첫번째 행에 결측치가 있을경우 뒤에있는 값으로 대채하라 

df.fillna(method="ffill").fillna(method="bfill")

       Yr_Mo_Dy    RPT    VAL    ROS  ...    BEL    MAL  weekday  WeekCheck
0    1961-01-01  15.04  14.96  13.17  ...  18.50  15.04        6          1
1    1961-01-02  14.71  14.96  10.83  ...  17.54  13.83        0          0
2    1961-01-03  18.50  16.88  12.33  ...  12.75  12.71        1          0
3    1961-01-04  10.58   6.63  11.75  ...   5.46  10.88        2          0
4    1961-01-05  13.33  13.25  11.42  ...  12.92  11.83        3          0
...         ...    ...    ...    ...  ...    ...    ...      ...        ...
6569 1978-12-27  17.58  16.96  17.62  ...  17.21  40.08        2          0
6570 1978-12-28  13.21   5.46  13.46  ...  21.79  41.46        3          0
6571 1978-12-29  14.00  10.29  14.42  ...  18.88  29.58        4          0
6572 1978-12-30  18.50  14.04  21.29  ...  14.67  28.79        5          1
6573 1978-12-31  20.33  17.41  27.29  ...  12.08  22.08        6          1

[6574 rows x 15 columns]

In [ ]:
df.groupby(df.Yr_Mo_Dy.dt.to_period("M")).mean()

                RPT        VAL        ROS  ...        MAL   weekday  WeekCheck
Yr_Mo_Dy                                   ...
1961-01   14.841333  11.988333  13.431613  ...  14.703226  2.935484   0.290323
1961-02   16.269286  14.975357  14.441481  ...  15.411786  3.000000   0.285714
1961-03   10.890000  11.296452  10.752903  ...  15.720000  3.000000   0.258065
1961-04   10.722667   9.427667   9.998000  ...  10.278333  3.166667   0.333333
1961-05    9.860968   8.850000  10.818065  ...  12.011613  2.806452   0.258065
...             ...        ...        ...  ...        ...       ...        ...
1978-08    9.645161   8.259355   9.032258  ...  12.054194  2.903226   0.258065
1978-09   10.913667  10.895000  10.635000  ...  19.391333  3.100000   0.300000
1978-10    9.897742   8.670968   9.295806  ...  17.150000  2.935484   0.290323
1978-11   16.151667  14.802667  13.508000  ...  20.723000  2.966667   0.266667
1978-12   16.175484  13.748065  15.635161  ...  21.371613  3.193548   0.322581

[216 rows x 14 columns]

In [ ]:
df["RPT"].diff()

0        NaN
1      -0.33
2       3.79
3      -7.92
4       2.75
        ...
6569    3.75
6570   -4.37
6571    0.79
6572    4.50
6573    1.83
Name: RPT, Length: 6574, dtype: float64

In [ ]:
df[["RPT", "VAL"]].rolling(7).mean()

            RPT        VAL
0           NaN        NaN
1           NaN        NaN
2           NaN        NaN
3           NaN        NaN
4           NaN        NaN
...         ...        ...
6569  11.868571   9.362857
6570  11.904286   9.595714
6571  13.017143  10.011429
6572  13.285714  10.118571
6573  14.951429  11.801429

[6574 rows x 2 columns]

In [ ]:
df =pd.read_csv('https://raw.githubusercontent.com/Datamanim/pandas/main/seoul_pm.csv')

df

          (년-월-일:시) PM10등급  PM10 PM2.5등급  ...  일산화탄소등급 일산화탄소  아황산가스등급  아황산가스
0     2021-05-15:15     보통  47.0      보통  ...       좋음   0.4       좋음  0.003
1     2021-05-15:14     보통  43.0      보통  ...       좋음   0.3       좋음  0.003
2     2021-05-15:13     보통  34.0      보통  ...       좋음   0.4       좋음  0.004
3     2021-05-15:12     보통  41.0      보통  ...       좋음   0.4       좋음  0.004
4     2021-05-15:11     보통  51.0      보통  ...       좋음   0.4       좋음  0.005
...             ...    ...   ...     ...  ...      ...   ...      ...    ...
1234  2021-03-25:05     보통  39.0      보통  ...       좋음   0.4       좋음  0.003
1235  2021-03-25:04     보통  34.0      좋음  ...       좋음   0.4       좋음  0.002
1236  2021-03-25:03     보통  35.0      좋음  ...       좋음   0.4       좋음  0.003
1237  2021-03-25:02     보통  35.0      좋음  ...       좋음   0.3       좋음  0.003
1238  2021-03-25:01     보통  42.0      좋음  ...       좋음   0.4       좋음  0.003

[1239 rows x 13 columns]

In [ ]:
def change_date(x):
    import datetime
    hour = x.split(':')[1]
    date = x.split(":")[0]
    
    if hour =='24':
        hour ='00:00:00'
        
        FinalDate = pd.to_datetime(date +" "+hour) +datetime.timedelta(days=1)
        
    else:
        hour = hour +':00:00'
        FinalDate = pd.to_datetime(date +" "+hour)
    
    return FinalDate

df['(년-월-일:시)'] = df['(년-월-일:시)'].apply(change_date)

Ans = df

In [ ]:
Ans.head(3)

            (년-월-일:시) PM10등급  PM10 PM2.5등급  ...  일산화탄소등급 일산화탄소  아황산가스등급  아황산가스
0 2021-05-15 15:00:00     보통  47.0      보통  ...       좋음   0.4       좋음  0.003
1 2021-05-15 14:00:00     보통  43.0      보통  ...       좋음   0.3       좋음  0.003
2 2021-05-15 13:00:00     보통  34.0      보통  ...       좋음   0.4       좋음  0.004

[3 rows x 13 columns]

In [ ]:
df['dayName']  =df['(년-월-일:시)'].dt.day_name()
df['dayName']

0       Saturday
1       Saturday
2       Saturday
3       Saturday
4       Saturday
          ...
1234    Thursday
1235    Thursday
1236    Thursday
1237    Thursday
1238    Thursday
Name: dayName, Length: 1239, dtype: object

In [ ]:
Ans1 = df.groupby(['dayName','PM10등급'],as_index=False).size()
Ans2 = Ans1.pivot(index='dayName',columns='PM10등급',values='size').fillna(0)

In [ ]:
Ans2

PM10등급       나쁨  매우나쁨     보통    좋음
dayName
Friday     31.0  17.0  120.0  21.0
Monday      1.0  21.0   83.0  63.0
Saturday   31.0  27.0   71.0  54.0
Sunday      2.0   1.0   67.0  98.0
Thursday   41.0   0.0  144.0   5.0
Tuesday    13.0  10.0   71.0  74.0
Wednesday  26.0   0.0   95.0  46.0

In [ ]:
check = len(df['(년-월-일:시)'].diff().unique())
if check ==2:
    Ans =True
else:
    Ans = False
Ans

True

In [ ]:
Ans = df.groupby(df['(년-월-일:시)'].dt.hour).mean().iloc[[10,22],[0]]

In [ ]:
df.set_index('(년-월-일:시)',inplace=True,drop=True)

In [ ]:
# 데이터를 주단위로 뽑아서 최소,최대 평균, 표준표차를 구하여라
df.resample('W').agg(['min','max','mean','std'])

            PM10                      ...  아황산가스
             min     max        mean  ...    max      mean       std
(년-월-일:시)                             ...
2021-03-28   6.0   160.0   72.747368  ...  0.006  0.003274  0.000961
2021-04-04   3.0   598.0   97.148810  ...  0.004  0.002732  0.000541
2021-04-11  17.0   102.0   41.059524  ...  0.004  0.002744  0.000569
2021-04-18   3.0   367.0   48.180723  ...  0.004  0.002464  0.000579
2021-04-25  17.0   126.0   55.119048  ...  0.011  0.003631  0.001763
2021-05-02   3.0    97.0   40.612121  ...  0.006  0.002524  0.000768
2021-05-09   8.0  1024.0  161.660714  ...  0.004  0.002771  0.000579
2021-05-16  16.0   111.0   40.014815  ...  0.006  0.002459  0.001696

[8 rows x 24 columns]

In [ ]:
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/pandas/main/under5MortalityRate.csv')
df

          Location  Period  ...        Dim1        First Tooltip
0      Afghanistan    2019  ...  Both sexes  60.27 [47.44-74.62]
1      Afghanistan    2019  ...        Male  63.83 [50.04-79.16]
2      Afghanistan    2019  ...      Female  56.57 [44.54-70.18]
3      Afghanistan    2018  ...  Both sexes  62.54 [50.64-75.41]
4      Afghanistan    2018  ...        Male  66.08 [53.41-79.76]
...            ...     ...  ...         ...                  ...
29994  Timor-Leste    2002  ...  Both sexes  96.97 [87.36-107.7]
29995  Timor-Leste    2002  ...        Male    102.6 [92.14-114]
29996  Timor-Leste    2002  ...      Female  91.04 [81.92-101.5]
29997  Timor-Leste    2001  ...  Both sexes  102.5 [92.72-113.3]
29998  Timor-Leste    2001  ...        Male    108.2 [97.57-120]

[29999 rows x 5 columns]

In [ ]:
df = df.drop(columns = "Indicator")
df

          Location  Period        Dim1  First Tooltip
0      Afghanistan    2019  Both sexes          60.27
1      Afghanistan    2019        Male          63.83
2      Afghanistan    2019      Female          56.57
3      Afghanistan    2018  Both sexes          62.54
4      Afghanistan    2018        Male          66.08
...            ...     ...         ...            ...
29994  Timor-Leste    2002  Both sexes          96.97
29995  Timor-Leste    2002        Male         102.60
29996  Timor-Leste    2002      Female          91.04
29997  Timor-Leste    2001  Both sexes         102.50
29998  Timor-Leste    2001        Male         108.20

[29999 rows x 4 columns]

In [ ]:
df["First Tooltip"] = df["First Tooltip"].map(lambda x : float(x.split("[")[0]))
df["First Tooltip"]

0         60.27
1         63.83
2         56.57
3         62.54
4         66.08
          ...
29994     96.97
29995    102.60
29996     91.04
29997    102.50
29998    108.20
Name: First Tooltip, Length: 29999, dtype: float64

In [ ]:
target =df[(df.Period >= 2015) & (df.Dim1 == "Both sexes")]

In [ ]:
Ans = target.pivot(index='Location',columns='Period',values='First Tooltip')
Ans

Period                                      2015   2016   2017   2018   2019
Location
Afghanistan                                70.44  67.57  64.94  62.54  60.27
Albania                                     9.57   9.42   9.42   9.53   9.68
Algeria                                    25.18  24.79  24.32  23.81  23.26
Andorra                                     3.53   3.37   3.22   3.09   2.97
Angola                                     88.20  84.21  80.62  77.67  74.69
...                                          ...    ...    ...    ...    ...
Syrian Arab Republic                       23.18  23.27  22.97  22.11  21.53
Tajikistan                                 37.75  36.82  35.81  34.80  33.78
Thailand                                   10.80  10.32   9.86   9.42   9.01
The former Yugoslav Republic of Macedonia  12.97  11.97   9.94   7.83   6.12
Timor-Leste                                50.76  49.01  47.27  45.62  44.22

[172 rows x 5 columns]

In [ ]:
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/pandas/main/mergeTEst.csv',index_col= 0)

In [ ]:
df1 = df.iloc[:4,:]
df2 = df.iloc[4:,:]

display(df1)
display(df2)

               2010    2011    2012    2013  ...    2016    2017    2018    2019
Location                                     ...
Afghanistan  64.023  61.640  59.367  57.170  ...  51.267  49.560  47.983  46.453
Albania      11.803  10.807   9.943   9.267  ...   8.363   8.363   8.453   8.597
Algeria      23.540  22.907  22.450  22.117  ...  21.257  20.850  20.407  19.930
Andorra       4.240   4.033   3.843   3.667  ...   3.187   3.060   2.933   2.827

[4 rows x 10 columns]

                       2010    2011    2012  ...    2017    2018    2019
Location                                     ...
Angola               75.713  71.280  67.233  ...  53.460  51.757  50.093
Antigua and Barbuda   8.667   8.223   7.807  ...   6.230   6.000   5.783
Argentina            12.887  12.380  11.840  ...   9.177   8.680   8.227
Armenia              16.497  15.677  14.897  ...  11.583  11.007  10.497
Australia             3.993   3.803   3.623  ...   3.137   3.090   3.047
Austria               3.573   3.463   3.333  ...   2.943   2.897   2.843

[6 rows x 10 columns]

In [ ]:
pd.concat([df1, df2], axis=0)

                       2010    2011    2012  ...    2017    2018    2019
Location                                     ...
Afghanistan          64.023  61.640  59.367  ...  49.560  47.983  46.453
Albania              11.803  10.807   9.943  ...   8.363   8.453   8.597
Algeria              23.540  22.907  22.450  ...  20.850  20.407  19.930
Andorra               4.240   4.033   3.843  ...   3.060   2.933   2.827
Angola               75.713  71.280  67.233  ...  53.460  51.757  50.093
Antigua and Barbuda   8.667   8.223   7.807  ...   6.230   6.000   5.783
Argentina            12.887  12.380  11.840  ...   9.177   8.680   8.227
Armenia              16.497  15.677  14.897  ...  11.583  11.007  10.497
Australia             3.993   3.803   3.623  ...   3.137   3.090   3.047
Austria               3.573   3.463   3.333  ...   2.943   2.897   2.843

[10 rows x 10 columns]

In [ ]:
df3 = df.iloc[:2,:4]
df4 = df.iloc[5:,3:]

In [ ]:
pd.concat([df3, df4], join =" inner")

ValueError: ignored

In [ ]:
pd.concat([df3,df4],join='outer').fillna(0)

                       2010    2011    2012  ...    2017    2018    2019
Location                                     ...
Afghanistan          64.023  61.640  59.367  ...   0.000   0.000   0.000
Albania              11.803  10.807   9.943  ...   0.000   0.000   0.000
Antigua and Barbuda   0.000   0.000   0.000  ...   6.230   6.000   5.783
Argentina             0.000   0.000   0.000  ...   9.177   8.680   8.227
Armenia               0.000   0.000   0.000  ...  11.583  11.007  10.497
Australia             0.000   0.000   0.000  ...   3.137   3.090   3.047
Austria               0.000   0.000   0.000  ...   2.943   2.897   2.843

[7 rows x 10 columns]

In [ ]:
df5 = df.T.iloc[:7,:3]
df6 = df.T.iloc[6:,2:5]

In [ ]:
pd.merge(df5,df6,on='Algeria',how='inner',left_index=True,right_index=True)

Location  Afghanistan  Albania  Algeria  Andorra  Angola
2016           51.267    8.363   21.257    3.187   55.51

In [ ]:
pd.merge(df5, df6, on="Algeria", how="inner", left_index=True, )

In [4]:
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/dataq/main/diamonds.csv',index_col=0)

In [6]:
df

       carat        cut color clarity  depth  table  price     x     y     z
1       0.23      Ideal     E     SI2   61.5   55.0    326  3.95  3.98  2.43
2       0.21    Premium     E     SI1   59.8   61.0    326  3.89  3.84  2.31
3       0.23       Good     E     VS1   56.9   65.0    327  4.05  4.07  2.31
4       0.29    Premium     I     VS2   62.4   58.0    334  4.20  4.23  2.63
5       0.31       Good     J     SI2   63.3   58.0    335  4.34  4.35  2.75
...      ...        ...   ...     ...    ...    ...    ...   ...   ...   ...
53936   0.72      Ideal     D     SI1   60.8   57.0   2757  5.75  5.76  3.50
53937   0.72       Good     D     SI1   63.1   55.0   2757  5.69  5.75  3.61
53938   0.70  Very Good     D     SI1   62.8   60.0   2757  5.66  5.68  3.56
53939   0.86    Premium     H     SI2   61.0   58.0   2757  6.15  6.12  3.74
53940   0.75      Ideal     D     SI2   62.2   55.0   2757  5.83  5.87  3.64

[53940 rows x 10 columns]

In [12]:
df_corr = df[["carat", "price"]].corr()
df_corr.iloc[0, 1]

0.9215913011935697

In [16]:
import scipy.stats as st
st.ttest_ind(df["carat"], df["price"])

Ttest_indResult(statistic=-228.9060465473468, pvalue=0.0)

In [20]:
h_prop = df[df["color"] == "H"]
st.ttest_1samp(h_prop["price"] , 3932)

Ttest_1sampResult(statistic=11.988997411117696, pvalue=7.569973305218302e-33)

In [23]:
h1 = df[df["color"] == "F"]
h2 = df[df["color"] == "G"]
st.levene(h1["price"] , h2["price"]), st.fligner(h1["price"] , h2["price"]), st.bartlett(h1["price"] , h2["price"])

(LeveneResult(statistic=53.627886257416655, pvalue=2.511093007074788e-13),
 FlignerResult(statistic=37.04347553879807, pvalue=1.155244880009172e-09),
 BartlettResult(statistic=47.52732212008511, pvalue=5.424264079418252e-12))

In [25]:
st.ttest_ind(h1["price"] , h2["price"], equal_var = False)

Ttest_indResult(statistic=-5.045279980436125, pvalue=4.5670321227041464e-07)

In [29]:
h1 = df[df["color"] == "F"]
h2 = df[df["color"] == "G"]
h3 = df[df["color"] == "D"]

st.f_oneway(h1["price"], h2["price"], h3["price"])

F_onewayResult(statistic=101.1811790316069, pvalue=1.6513790091285713e-44)

In [38]:
num_df = df.select_dtypes(exclude="object")

q1 = df.quantile(0.25)
q3 = df.quantile(0.75)
iqr = q3 - q1

Q1_iqr = df.carat.quantile(0.25) - (iqr * 1.5 )
Q3_iqr = df.carat.quantile(0.75) + (iqr * 1.5 )

df[(df.carat <= Q1_iqr) | (df.carat >= Q3_iqr)]

ValueError: ignored

In [40]:
df

       carat        cut color clarity  depth  table  price     x     y     z
1       0.23      Ideal     E     SI2   61.5   55.0    326  3.95  3.98  2.43
2       0.21    Premium     E     SI1   59.8   61.0    326  3.89  3.84  2.31
3       0.23       Good     E     VS1   56.9   65.0    327  4.05  4.07  2.31
4       0.29    Premium     I     VS2   62.4   58.0    334  4.20  4.23  2.63
5       0.31       Good     J     SI2   63.3   58.0    335  4.34  4.35  2.75
...      ...        ...   ...     ...    ...    ...    ...   ...   ...   ...
53936   0.72      Ideal     D     SI1   60.8   57.0   2757  5.75  5.76  3.50
53937   0.72       Good     D     SI1   63.1   55.0   2757  5.69  5.75  3.61
53938   0.70  Very Good     D     SI1   62.8   60.0   2757  5.66  5.68  3.56
53939   0.86    Premium     H     SI2   61.0   58.0   2757  6.15  6.12  3.74
53940   0.75      Ideal     D     SI2   62.2   55.0   2757  5.83  5.87  3.64

[53940 rows x 10 columns]

In [44]:
df.groupby("color")["price"].agg(["max", "min", "mean"])

         max  min         mean
color
D      18693  357  3169.954096
E      18731  326  3076.752475
F      18791  342  3724.886397
G      18818  354  3999.135671
H      18803  337  4486.669196
I      18823  334  5091.874954
J      18710  335  5323.818020

In [46]:
from sklearn.preprocessing import LabelEncoder

encoder = LabelEncoder()
df["color"] = encoder.fit_transform(df["color"])
df["color"].value_counts()

3    11292
1     9797
2     9542
4     8304
0     6775
5     5422
6     2808
Name: color, dtype: int64

In [47]:
import requests
from bs4 import BeautifulSoup as soup

url = 'https://movie.naver.com/movie/sdb/rank/rmovie.nhn?sel=cur&date=20210503'

data = requests.get(url)
soup = soup(data.text)

In [50]:
soup.head()[:5]

[<meta content="text/html; charset=utf-8" http-equiv="Content-Type"/>,
 <meta content="IE=edge" http-equiv="X-UA-Compatible"/>,
 <meta content="http://imgmovie.naver.com/today/naverme/naverme_profile.jpg" property="me2:image"/>,
 <meta content="네이버영화 " property="me2:post_tag"/>,
 <meta content="네이버영화" property="me2:category1"/>]

In [ ]:
# 구조를 지켜면서 출력하는 방법 
print(soup.prettify())

In [52]:
soup.find_all("meta")

[<meta content="text/html; charset=utf-8" http-equiv="Content-Type"/>,
 <meta content="IE=edge" http-equiv="X-UA-Compatible"/>,
 <meta content="http://imgmovie.naver.com/today/naverme/naverme_profile.jpg" property="me2:image"/>,
 <meta content="네이버영화 " property="me2:post_tag"/>,
 <meta content="네이버영화" property="me2:category1"/>,
 <meta content="" property="me2:category2"/>,
 <meta content="랭킹 : 네이버 영화" property="og:title"/>,
 <meta content="영화, 영화인, 예매, 박스오피스 랭킹 정보 제공" property="og:description"/>,
 <meta content="article" property="og:type"/>,
 <meta content="https://movie.naver.com/movie/sdb/rank/rmovie.nhn?sel=cur&amp;date=20210503" property="og:url"/>,
 <meta content="http://static.naver.net/m/movie/icons/OG_270_270.png" property="og:image"/>,
 <meta content="http://imgmovie.naver.com/today/naverme/naverme_profile.jpg" property="og:article:thumbnailUrl"/>,
 <meta content="네이버 영화" property="og:article:author"/>,
 <meta content="https://movie.naver.com/" property="og:article:author:url"/>]

In [ ]:
soup.find(class_="list_ranking")

In [59]:
url = "https://raw.githubusercontent.com/Datamanim/video/master/video_games_sale.csv"

df = pd.read_csv(url, index_col=0)
df.head(2)

             Name Platform  Year_of_Release  ... Developer Rating  Year_of_ten
0      Wii Sports      Wii           2006.0  ...  Nintendo      E       2000.0
1  Mario Kart Wii      Wii           2008.0  ...  Nintendo      E       2000.0

[2 rows x 17 columns]

In [65]:
df["Year_of_Release"] = df["Year_of_Release"].map(lambda x : x//10 *10)
df["Year_of_Release"].value_counts()

2000.0    4609
2010.0    2137
1990.0      77
1980.0       2
Name: Year_of_Release, dtype: int64

In [69]:
print("max : ", int(df["Year_of_Release"].value_counts().index[0]))
print("min : ", int(df["Year_of_Release"].value_counts().index[-1]))

max :  2000
min :  1980

In [72]:
len(df[(df.Platform.isin(["PS","PS2","PS3","PS4", "PSV"])) & (df.Genre == "Action")])

616

In [90]:
df_list = df.Platform.value_counts()[df.Platform.value_counts() >= 400].index
df[df.Platform.isin(df_list)].groupby("Platform")["User_Score"].mean().sort_values(ascending=False).to_frame()

          User_Score
Platform
PS2         7.664386
XB          7.540708
PC          7.060369
DS          7.047198
Wii         6.903758
PS3         6.782705
X360        6.780769

In [97]:
target = df[df.Name.str.contains("Mario")]["Developer"].value_counts()

target[target == 3].index

Index(['Nintendo, Nintendo Software Technology', 'Nintendo, Nd Cube'], dtype='object')

In [99]:
df[df.Platform == "PS2"].User_Score.kurtosis()

2.4920035946875965

In [100]:
# 일반적으로 boolen 타입의 True는 1로 인식하기에 전체 합을 구한다.
Ans = (df[['NA_Sales','EU_Sales','JP_Sales','Other_Sales']].sum(axis=1) != df['Global_Sales']).sum()

In [101]:
Ans

3636

In [103]:
len(df[(df.User_Count >= 120) & (df.User_Score >=9.0)])

86

In [107]:
from sklearn.preprocessing import RobustScaler

rb = RobustScaler()

rb_global = rb.fit_transform(df.Global_Sales.values.reshape(-1,1))

len(rb_global[rb_global>40])

6